OldTests/Linux-BareMetal-4core/benchmark_raw_20260415_085323/raw_logs/fio_rand_4k_raw.txt
rand_4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

rand_4k: (groupid=0, jobs=1): err= 0: pid=382266: Wed Apr 15 09:06:13 2026
  read: IOPS=4667, BW=18.2MiB/s (19.1MB/s)(1094MiB/60001msec)
    clat (usec): min=42, max=42482, avg=180.37, stdev=227.90
     lat (usec): min=42, max=42482, avg=180.43, stdev=227.90
    clat percentiles (usec):
     |  1.00th=[   81],  5.00th=[   86], 10.00th=[   95], 20.00th=[  104],
     | 30.00th=[  153], 40.00th=[  157], 50.00th=[  159], 60.00th=[  167],
     | 70.00th=[  172], 80.00th=[  176], 90.00th=[  180], 95.00th=[  219],
     | 99.00th=[ 1582], 99.50th=[ 1909], 99.90th=[ 2278], 99.95th=[ 2311],
     | 99.99th=[ 3490]
   bw (  KiB/s): min=11968, max=20944, per=100.00%, avg=18671.26, stdev=1427.74, samples=119
   iops        : min= 2992, max= 5236, avg=4667.82, stdev=356.93, samples=119
  write: IOPS=4670, BW=18.2MiB/s (19.1MB/s)(1095MiB/60001msec); 0 zone resets
    clat (usec): min=26, max=37622, avg=32.37, stdev=97.89
     lat (usec): min=26, max=37622, avg=32.46, stdev=97.90
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   29], 10.00th=[   29], 20.00th=[   29],
     | 30.00th=[   30], 40.00th=[   30], 50.00th=[   30], 60.00th=[   30],
     | 70.00th=[   31], 80.00th=[   32], 90.00th=[   34], 95.00th=[   45],
     | 99.00th=[   79], 99.50th=[  102], 99.90th=[  163], 99.95th=[  194],
     | 99.99th=[  239]
   bw (  KiB/s): min=12048, max=21528, per=100.00%, avg=18689.41, stdev=1493.14, samples=119
   iops        : min= 3012, max= 5382, avg=4672.35, stdev=373.29, samples=119
  lat (usec)   : 50=48.08%, 100=10.09%, 250=39.82%, 500=0.68%, 750=0.46%
  lat (usec)   : 1000=0.15%
  lat (msec)   : 2=0.51%, 4=0.21%, 10=0.01%, 50=0.01%
  cpu          : usr=1.75%, sys=7.07%, ctx=560283, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=280032,280254,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=18.2MiB/s (19.1MB/s), 18.2MiB/s-18.2MiB/s (19.1MB/s-19.1MB/s), io=1094MiB (1147MB), run=60001-60001msec
  WRITE: bw=18.2MiB/s (19.1MB/s), 18.2MiB/s-18.2MiB/s (19.1MB/s-19.1MB/s), io=1095MiB (1148MB), run=60001-60001msec

Disk stats (read/write):
  sda: ios=279509/279830, sectors=2236072/2238832, merge=0/25, ticks=48751/7443, in_queue=56196, util=93.26%